Revit 2027 API
FabricationConfiguration.GetAllInsulationSpecifications Method
 Gets all insulation specification identifiers in the fabrication configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetAllInsulationSpecifications(
	FabricationPart pFabPart
)
Public Function GetAllInsulationSpecifications (
	pFabPart As FabricationPart
) As IList(Of Integer)
public:
IList<int>^ GetAllInsulationSpecifications(
	FabricationPart^ pFabPart
)
member GetAllInsulationSpecifications :
        pFabPart : FabricationPart -> IList<int>
Parameters
pFabPart FabricationPart
 The fabrication part.
Return Value
IList<Int32>
 An array of insulation specification identifiers.
Remarks
 If a part is passed, only returns insulation specification which are valid for the part, otherwise returns all insulation specifications.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace